; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph1 - mode
	infrared9 - mode
	spectrograph4 - mode
	spectrograph6 - mode
	spectrograph3 - mode
	infrared8 - mode
	spectrograph5 - mode
	infrared2 - mode
	spectrograph0 - mode
	infrared7 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared7)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared7)
	(supports instrument1 infrared8)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared9)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph6)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 infrared2)
	(supports instrument5 infrared8)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Phenomenon7 spectrograph3)
	(have_image Phenomenon7 spectrograph4)
	(have_image Planet8 spectrograph1)
	(have_image Planet8 spectrograph0)
	(have_image Planet8 spectrograph6)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 spectrograph3)
	(have_image Planet10 spectrograph5)
	(have_image Planet10 spectrograph4)
	(have_image Star11 infrared7)
	(have_image Star11 infrared8)
))

)

; plan
1. (turn_to satellite1 groundstation5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 12
2. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 12
3. (calibrate satellite1 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 0 of 12
4. (turn_to satellite1 planet10 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet10)
   goals met: 0 of 12
5. (take_image satellite1 planet10 instrument5 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon7 instrument5 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 2 of 12
8. (turn_to satellite1 groundstation2 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 12
9. (turn_to satellite0 groundstation0 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 12
10. (switch_off instrument5 satellite1)
   deleted: (power_on instrument5)
   added: (power_avail satellite1)
   goals met: 2 of 12
11. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 12
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 12
13. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 2 of 12
14. (calibrate satellite1 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 2 of 12
15. (turn_to satellite0 star11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star11)
   goals met: 2 of 12
16. (take_image satellite0 star11 instrument1 infrared7)
   added: (have_image star11 infrared7)
   goals met: 3 of 12
17. (take_image satellite0 star11 instrument1 infrared8)
   added: (have_image star11 infrared8)
   goals met: 4 of 12
18. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 12
19. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 12
20. (turn_to satellite0 groundstation0 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 12
21. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 4 of 12
22. (turn_to satellite0 phenomenon9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 12
23. (take_image satellite0 phenomenon9 instrument2 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 5 of 12
24. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 5 of 12
25. (take_image satellite0 planet10 instrument2 spectrograph5)
   added: (have_image planet10 spectrograph5)
   goals met: 6 of 12
26. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   goals met: 7 of 12
27. (take_image satellite0 planet8 instrument2 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 8 of 12
28. (turn_to satellite1 phenomenon7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon7)
   goals met: 8 of 12
29. (take_image satellite1 phenomenon7 instrument4 spectrograph3)
   added: (have_image phenomenon7 spectrograph3)
   goals met: 9 of 12
30. (turn_to satellite1 planet10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet10)
   goals met: 9 of 12
31. (take_image satellite1 planet10 instrument4 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 10 of 12
32. (turn_to satellite1 planet8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet8)
   goals met: 10 of 12
33. (take_image satellite1 planet8 instrument4 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 11 of 12
34. (take_image satellite1 planet8 instrument4 spectrograph6)
   added: (have_image planet8 spectrograph6)
   goals met: 12 of 12
